edub0/rcp_esp32_ble_racechrono/sdkconfig.defaults
# ESP32-S3 Target
CONFIG_IDF_TARGET="esp32s3"

# Enable Bluetooth
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y

# Enable WiFi
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=0
CONFIG_ESP_WIFI_CSI_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# Enable LWIP
CONFIG_LWIP_IPV6=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Partition Table
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_PARTITION_TABLE_FILENAME="partitions_singleapp_large.csv"

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
CONFIG_TIREX_SUPPRESS_BLE_IDLE_SEND_WARNINGS=y

# EXLAP Gateway
CONFIG_EXLAP_TESTING_AP_UI=y
CONFIG_EXLAP_ENABLED=y
CONFIG_EXLAP_PARSER_CONSOLE_LOGGING=y
CONFIG_EXLAP_AUTO_CONNECT=y
